**`teams/nomis/rhel_7_9_baseimage`** terraform plan on `pull_request` event [#534](${url})

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.imagebuilder["rhel_7_9_baseimage"].aws_imagebuilder_component.this["../components/ansible.yml.tftpl"] must be replaced
+/- resource "aws_imagebuilder_component" "this" {
      ~ arn                   = "arn:aws:imagebuilder:eu-west-2:374269020027:component/nomis-rhel-7-9-baseimage-ansible/1.3.9/1" -> (known after apply)
      ~ data                  = <<-EOT # forces replacement
            ---
            name: nomis_rhel_7_9_baseimage_ansible
            description: Install ansible roles for nomis_rhel_7_9_baseimage
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
          -       default: 1.3.9
          +       default: 1.4.0
                  description: Uses the recipe version to avoid any issues with the branch template arg.
              - Platform:
                  type: string
                  default: "Linux"
                  description: Platform.
            phases:
              - name: build
                steps:
                  # Install ansible roles
                  - name: InstallAndRunAnsible
                    action: ExecuteBash
                    inputs:
                      commands:
                        - |
                          set -e
                          repo="modernisation-platform-ami-builds"
                          ami_tag="nomis_rhel_7_9_baseimage"
            
                          # clone ansible roles and playbook
                          ansible_dir=$(mktemp -d)
                          echo "Cloning $repo into $ansible_dir using branch=main"
                          cd $ansible_dir
                          git clone -b main "https://github.com/ministryofjustice/$repo.git"
            
                          # set python version
                          if [[ $(which python3.9) ]]; then
                            python=$(which python3.9)
                          elif [[ $(which python3.6) ]]; then
                            python=$(which python3.6)
                          else
                            echo "Python3.9/3.6 not found"
                            exit 1
                          fi
                          echo "python: $python"
            
                          # install python dependencies outside of virtual env so ansible
                          # can be executed remotely
                          cd $ansible_dir/$repo/ansible
                          $python -m pip install -r requirements.txt
            
                          # activate virtual environment
                          mkdir $ansible_dir/python-venv && cd "$_"
                          $python -m venv ansible
                          source ansible/bin/activate
                          $python -m pip install --upgrade pip
                          if [[ "$python" =~ 3.6 ]]; then
                            $python -m pip install wheel
                            $python -m pip install cryptography==2.3
                            export LC_ALL=en_US.UTF-8
                            $python -m pip install ansible-core==2.11.12
                          else
                            $python -m pip install ansible==6.0.0
                          fi
            
                          # install requirements in virtual env
                          cd $ansible_dir/$repo/ansible
                          $python -m pip install -r requirements.txt
                          ansible-galaxy role install -r requirements.yml
                          ansible-galaxy collection install -r requirements.yml --force
            
                          # run ansible
                          ansible-playbook site.yml \
                          --connection=local \
                          --inventory localhost \
                          --extra-vars "ansible_python_interpreter=$python" \
                          --extra-vars "target=localhost" \
                          --extra-vars "@group_vars/ami_$ami_tag.yml" \
                          --tags amibuild \
                          --become
            
                          # Cleanup
                          deactivate
                          echo "Cleaning up $ansible_dir"
                          rm -rf $ansible_dir/$repo
                          rm -rf $ansible_dir/python-venv
                          rmdir $ansible_dir
        EOT
      ~ date_created          = "2022-10-06T12:47:32.310Z" -> (known after apply)
      ~ encrypted             = true -> (known after apply)
      ~ id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/nomis-rhel-7-9-baseimage-ansible/1.3.9/1" -> (known after apply)
        name                  = "nomis_rhel_7_9_baseimage_ansible"
      ~ owner                 = "374269020027" -> (known after apply)
      - supported_os_versions = [] -> null
      ~ tags                  = {
          ~ "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.3.9" -> "nomis_rhel_7_9_baseimage/1.4.0"
          ~ "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.3.9" -> "nomis_rhel_7_9_baseimage/1.4.0"
          ~ "nomis_rhel_7_9_baseimage_ansible-version"  = "1.3.9" -> "1.4.0"
            # (16 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.3.9" -> "nomis_rhel_7_9_baseimage/1.4.0"
          ~ "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.3.9" -> "nomis_rhel_7_9_baseimage/1.4.0"
          ~ "nomis_rhel_7_9_baseimage_ansible-version"  = "1.3.9" -> "1.4.0"
            # (16 unchanged elements hidden)
        }
      ~ type                  = "BUILD" -> (known after apply)
      ~ version               = "1.3.9" -> "1.4.0" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.imagebuilder["rhel_7_9_baseimage"].aws_imagebuilder_component.this["../components/ansible.yml.tftpl"] (deposed object cb29e7a0) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_imagebuilder_component" "this" {
      - arn                   = "arn:aws:imagebuilder:eu-west-2:374269020027:component/nomis-rhel-7-9-baseimage-ansible/1.3.8/1" -> null
      - data                  = <<-EOT
            ---
            name: nomis_rhel_7_9_baseimage_ansible
            description: Install ansible roles for nomis_rhel_7_9_baseimage
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
                  default: 1.3.8
                  description: Uses the recipe version to avoid any issues with the branch template arg.
              - Platform:
                  type: string
                  default: "Linux"
                  description: Platform.
            phases:
              - name: build
                steps:
                  # Install ansible roles
                  - name: InstallAndRunAnsible
                    action: ExecuteBash
                    inputs:
                      commands:
                        - |
                          set -e
                          repo="modernisation-platform-ami-builds"
                          ami_tag="nomis_rhel_7_9_baseimage"
            
                          # clone ansible roles and playbook
                          ansible_dir=$(mktemp -d)
                          echo "Cloning $repo into $ansible_dir using branch=nomis/DSOS-1498/add-distribution-accounts"
                          cd $ansible_dir
                          git clone -b nomis/DSOS-1498/add-distribution-accounts "https://github.com/ministryofjustice/$repo.git"
            
                          # set python version
                          if [[ $(which python3.9) ]]; then
                            python=$(which python3.9)
                          elif [[ $(which python3.6) ]]; then
                            python=$(which python3.6)
                          else
                            echo "Python3.9/3.6 not found"
                            exit 1
                          fi
                          echo "python: $python"
            
                          # install python dependencies outside of virtual env so ansible
                          # can be executed remotely
                          cd $ansible_dir/$repo/ansible
                          $python -m pip install -r requirements.txt
            
                          # activate virtual environment
                          mkdir $ansible_dir/python-venv && cd "$_"
                          $python -m venv ansible
                          source ansible/bin/activate
                          $python -m pip install --upgrade pip
                          if [[ "$python" =~ 3.6 ]]; then
                            $python -m pip install wheel
                            $python -m pip install cryptography==2.3
                            export LC_ALL=en_US.UTF-8
                            $python -m pip install ansible-core==2.11.12
                          else
                            $python -m pip install ansible==6.0.0
                          fi
            
                          # install requirements in virtual env
                          cd $ansible_dir/$repo/ansible
                          $python -m pip install -r requirements.txt
                          ansible-galaxy role install -r requirements.yml
                          ansible-galaxy collection install -r requirements.yml --force
            
                          # run ansible
                          ansible-playbook site.yml \
                          --connection=local \
                          --inventory localhost \
                          --extra-vars "ansible_python_interpreter=$python" \
                          --extra-vars "target=localhost" \
                          --extra-vars "@group_vars/ami_$ami_tag.yml" \
                          --tags amibuild \
                          --become
            
                          # Cleanup
                          deactivate
                          echo "Cleaning up $ansible_dir"
                          rm -rf $ansible_dir/$repo
                          rm -rf $ansible_dir/python-venv
                          rmdir $ansible_dir
        EOT -> null
      - date_created          = "2022-10-05T12:19:33.971Z" -> null
      - description           = "Install ansible roles for nomis_rhel_7_9_baseimage" -> null
      - encrypted             = true -> null
      - id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/nomis-rhel-7-9-baseimage-ansible/1.3.8/1" -> null
      - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
      - name                  = "nomis_rhel_7_9_baseimage_ansible" -> null
      - owner                 = "374269020027" -> null
      - platform              = "Linux" -> null
      - supported_os_versions = [] -> null
      - tags                  = {
          - "amazon-cloudwatch-agent-linux-version"     = "1.0.1"
          - "application"                               = "NOMIS"
          - "aws-cli-version-2-linux-version"           = "1.0.3"
          - "branch"                                    = "nomis/DSOS-1498/add-distribution-accounts"
          - "business-unit"                             = "HMPPS"
          - "github-actor"                              = "james-borwick"
          - "image-pipeline"                            = "nomis_rhel_7_9_baseimage"
          - "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.3.8"
          - "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.3.8"
          - "is-production"                             = "false"
          - "nomis_rhel_7_9_baseimage_ansible-version"  = "1.3.8"
          - "nomis_rhel_7_9_baseimage_packages-version" = "0.0.1"
          - "nomis_rhel_7_9_baseimage_python-version"   = "0.0.1"
          - "os-version"                                = "rhel 7.9"
          - "owner"                                     = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          - "release-or-patch"                          = "n/a"
          - "source-code"                               = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
          - "stig-build-linux-medium-version"           = "2022.3.0"
          - "update-linux-version"                      = "1.0.2"
        } -> null
      - tags_all              = {
          - "amazon-cloudwatch-agent-linux-version"     = "1.0.1"
          - "application"                               = "NOMIS"
          - "aws-cli-version-2-linux-version"           = "1.0.3"
          - "branch"                                    = "nomis/DSOS-1498/add-distribution-accounts"
          - "business-unit"                             = "HMPPS"
          - "github-actor"                              = "james-borwick"
          - "image-pipeline"                            = "nomis_rhel_7_9_baseimage"
          - "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.3.8"
          - "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.3.8"
          - "is-production"                             = "false"
          - "nomis_rhel_7_9_baseimage_ansible-version"  = "1.3.8"
          - "nomis_rhel_7_9_baseimage_packages-version" = "0.0.1"
          - "nomis_rhel_7_9_baseimage_python-version"   = "0.0.1"
          - "os-version"                                = "rhel 7.9"
          - "owner"                                     = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          - "release-or-patch"                          = "n/a"
          - "source-code"                               = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
          - "stig-build-linux-medium-version"           = "2022.3.0"
          - "update-linux-version"                      = "1.0.2"
        } -> null
      - type                  = "BUILD" -> null
      - version               = "1.3.8" -> null
    }

  # module.imagebuilder["rhel_7_9_baseimage"].aws_imagebuilder_component.this["../components/rhel_7_9_baseimage/packages.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/nomis-rhel-7-9-baseimage-packages/0.0.1/1"
        name                  = "nomis_rhel_7_9_baseimage_packages"
      ~ tags                  = {
          ~ "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.3.9" -> "nomis_rhel_7_9_baseimage/1.4.0"
          ~ "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.3.9" -> "nomis_rhel_7_9_baseimage/1.4.0"
          ~ "nomis_rhel_7_9_baseimage_ansible-version"  = "1.3.9" -> "1.4.0"
            # (16 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.3.9" -> "nomis_rhel_7_9_baseimage/1.4.0"
          ~ "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.3.9" -> "nomis_rhel_7_9_baseimage/1.4.0"
          ~ "nomis_rhel_7_9_baseimage_ansible-version"  = "1.3.9" -> "1.4.0"
            # (16 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.imagebuilder["rhel_7_9_baseimage"].aws_imagebuilder_component.this["../components/rhel_7_9_baseimage/python.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/nomis-rhel-7-9-baseimage-python/0.0.1/1"
        name                  = "nomis_rhel_7_9_baseimage_python"
      ~ tags                  = {
          ~ "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.3.9" -> "nomis_rhel_7_9_baseimage/1.4.0"
          ~ "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.3.9" -> "nomis_rhel_7_9_baseimage/1.4.0"
          ~ "nomis_rhel_7_9_baseimage_ansible-version"  = "1.3.9" -> "1.4.0"
            # (16 unchanged elements hidden)
        }
      ~ tags_all              = {
          ~ "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.3.9" -> "nomis_rhel_7_9_baseimage/1.4.0"
          ~ "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.3.9" -> "nomis_rhel_7_9_baseimage/1.4.0"
          ~ "nomis_rhel_7_9_baseimage_ansible-version"  = "1.3.9" -> "1.4.0"
            # (16 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.imagebuilder["rhel_7_9_baseimage"].aws_imagebuilder_distribution_configuration.this will be updated in-place
  ~ resource "aws_imagebuilder_distribution_configuration" "this" {
        id           = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/nomis-rhel-7-9-baseimage"
        name         = "nomis_rhel_7_9_baseimage"
      ~ tags         = {
          ~ "branch"                                    = "nomis/DSOS-1498/add-distribution-accounts" -> "main"
          ~ "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.3.8" -> "nomis_rhel_7_9_baseimage/1.4.0"
          ~ "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.3.8" -> "nomis_rhel_7_9_baseimage/1.4.0"
          ~ "is-production"                             = "false" -> "true"
          ~ "nomis_rhel_7_9_baseimage_ansible-version"  = "1.3.8" -> "1.4.0"
            # (14 unchanged elements hidden)
        }
      ~ tags_all     = {
          ~ "branch"                                    = "nomis/DSOS-1498/add-distribution-accounts" -> "main"
          ~ "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.3.8" -> "nomis_rhel_7_9_baseimage/1.4.0"
          ~ "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.3.8" -> "nomis_rhel_7_9_baseimage/1.4.0"
          ~ "is-production"                             = "false" -> "true"
          ~ "nomis_rhel_7_9_baseimage_ansible-version"  = "1.3.8" -> "1.4.0"
            # (14 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

      ~ distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder["rhel_7_9_baseimage"].aws_imagebuilder_image_pipeline.this will be created
  + resource "aws_imagebuilder_image_pipeline" "this" {
      + arn                              = (known after apply)
      + date_created                     = (known after apply)
      + date_last_run                    = (known after apply)
      + date_next_run                    = (known after apply)
      + date_updated                     = (known after apply)
      + description                      = "nomis RHEL7.9 base image"
      + distribution_configuration_arn   = "arn:aws:imagebuilder:eu-west-2:374269020027:distribution-configuration/nomis-rhel-7-9-baseimage"
      + enhanced_image_metadata_enabled  = true
      + id                               = (known after apply)
      + image_recipe_arn                 = (known after apply)
      + infrastructure_configuration_arn = (known after apply)
      + name                             = "nomis_rhel_7_9_baseimage"
      + platform                         = (known after apply)
      + status                           = "ENABLED"
      + tags                             = {
          + "amazon-cloudwatch-agent-linux-version"     = "1.0.1"
          + "application"                               = "NOMIS"
          + "aws-cli-version-2-linux-version"           = "1.0.3"
          + "branch"                                    = "main"
          + "business-unit"                             = "HMPPS"
          + "github-actor"                              = "james-borwick"
          + "image-pipeline"                            = "nomis_rhel_7_9_baseimage"
          + "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.4.0"
          + "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.4.0"
          + "is-production"                             = "true"
          + "nomis_rhel_7_9_baseimage_ansible-version"  = "1.4.0"
          + "nomis_rhel_7_9_baseimage_packages-version" = "0.0.1"
          + "nomis_rhel_7_9_baseimage_python-version"   = "0.0.1"
          + "os-version"                                = "rhel 7.9"
          + "owner"                                     = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"                          = "n/a"
          + "source-code"                               = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
          + "stig-build-linux-medium-version"           = "2022.3.0"
          + "update-linux-version"                      = "1.0.2"
        }
      + tags_all                         = {
          + "amazon-cloudwatch-agent-linux-version"     = "1.0.1"
          + "application"                               = "NOMIS"
          + "aws-cli-version-2-linux-version"           = "1.0.3"
          + "branch"                                    = "main"
          + "business-unit"                             = "HMPPS"
          + "github-actor"                              = "james-borwick"
          + "image-pipeline"                            = "nomis_rhel_7_9_baseimage"
          + "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.4.0"
          + "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.4.0"
          + "is-production"                             = "true"
          + "nomis_rhel_7_9_baseimage_ansible-version"  = "1.4.0"
          + "nomis_rhel_7_9_baseimage_packages-version" = "0.0.1"
          + "nomis_rhel_7_9_baseimage_python-version"   = "0.0.1"
          + "os-version"                                = "rhel 7.9"
          + "owner"                                     = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          + "release-or-patch"                          = "n/a"
          + "source-code"                               = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
          + "stig-build-linux-medium-version"           = "2022.3.0"
          + "update-linux-version"                      = "1.0.2"
        }

      + image_tests_configuration {
          + image_tests_enabled = false
          + timeout_minutes     = 720
        }

      + schedule {
          + pipeline_execution_start_condition = "EXPRESSION_MATCH_AND_DEPENDENCY_UPDATES_AVAILABLE"
          + schedule_expression                = "cron(0 0 1 * ? *)"
          + timezone                           = (known after apply)
        }
    }

  # module.imagebuilder["rhel_7_9_baseimage"].aws_imagebuilder_image_recipe.this must be replaced
+/- resource "aws_imagebuilder_image_recipe" "this" {
      ~ arn              = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-rhel-7-9-baseimage/1.3.9" -> (known after apply)
      ~ date_created     = "2022-10-06T12:47:36.686Z" -> (known after apply)
      ~ id               = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-rhel-7-9-baseimage/1.3.9" -> (known after apply)
        name             = "nomis_rhel_7_9_baseimage"
      ~ owner            = "374269020027" -> (known after apply)
      ~ platform         = "Linux" -> (known after apply)
      ~ tags             = {
          ~ "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.3.9" -> "nomis_rhel_7_9_baseimage/1.4.0"
          ~ "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.3.9" -> "nomis_rhel_7_9_baseimage/1.4.0"
          ~ "nomis_rhel_7_9_baseimage_ansible-version"  = "1.3.9" -> "1.4.0"
            # (16 unchanged elements hidden)
        }
      ~ tags_all         = {
          ~ "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.3.9" -> "nomis_rhel_7_9_baseimage/1.4.0"
          ~ "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.3.9" -> "nomis_rhel_7_9_baseimage/1.4.0"
          ~ "nomis_rhel_7_9_baseimage_ansible-version"  = "1.3.9" -> "1.4.0"
            # (16 unchanged elements hidden)
        }
      + user_data_base64 = (known after apply)
      ~ version          = "1.3.9" -> "1.4.0" # forces replacement
        # (2 unchanged attributes hidden)

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }
      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }

      ~ component {
          ~ component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/nomis-rhel-7-9-baseimage-ansible/1.3.9/1" -> (known after apply) # forces replacement
        }

        # (7 unchanged blocks hidden)
    }

  # module.imagebuilder["rhel_7_9_baseimage"].aws_imagebuilder_image_recipe.this (deposed object 334e5944) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_imagebuilder_image_recipe" "this" {
      - arn          = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-rhel-7-9-baseimage/1.3.8" -> null
      - date_created = "2022-10-05T12:19:39.282Z" -> null
      - description  = "nomis RHEL7.9 base image" -> null
      - id           = "arn:aws:imagebuilder:eu-west-2:374269020027:image-recipe/nomis-rhel-7-9-baseimage/1.3.8" -> null
      - name         = "nomis_rhel_7_9_baseimage" -> null
      - owner        = "374269020027" -> null
      - parent_image = "ami-0a8aebd46fb700315" -> null
      - platform     = "Linux" -> null
      - tags         = {
          - "amazon-cloudwatch-agent-linux-version"     = "1.0.1"
          - "application"                               = "NOMIS"
          - "aws-cli-version-2-linux-version"           = "1.0.3"
          - "branch"                                    = "nomis/DSOS-1498/add-distribution-accounts"
          - "business-unit"                             = "HMPPS"
          - "github-actor"                              = "james-borwick"
          - "image-pipeline"                            = "nomis_rhel_7_9_baseimage"
          - "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.3.8"
          - "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.3.8"
          - "is-production"                             = "false"
          - "nomis_rhel_7_9_baseimage_ansible-version"  = "1.3.8"
          - "nomis_rhel_7_9_baseimage_packages-version" = "0.0.1"
          - "nomis_rhel_7_9_baseimage_python-version"   = "0.0.1"
          - "os-version"                                = "rhel 7.9"
          - "owner"                                     = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          - "release-or-patch"                          = "n/a"
          - "source-code"                               = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
          - "stig-build-linux-medium-version"           = "2022.3.0"
          - "update-linux-version"                      = "1.0.2"
        } -> null
      - tags_all     = {
          - "amazon-cloudwatch-agent-linux-version"     = "1.0.1"
          - "application"                               = "NOMIS"
          - "aws-cli-version-2-linux-version"           = "1.0.3"
          - "branch"                                    = "nomis/DSOS-1498/add-distribution-accounts"
          - "business-unit"                             = "HMPPS"
          - "github-actor"                              = "james-borwick"
          - "image-pipeline"                            = "nomis_rhel_7_9_baseimage"
          - "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.3.8"
          - "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.3.8"
          - "is-production"                             = "false"
          - "nomis_rhel_7_9_baseimage_ansible-version"  = "1.3.8"
          - "nomis_rhel_7_9_baseimage_packages-version" = "0.0.1"
          - "nomis_rhel_7_9_baseimage_python-version"   = "0.0.1"
          - "os-version"                                = "rhel 7.9"
          - "owner"                                     = "DSO: digital-studio-operations-team@digital.justice.gov.uk"
          - "release-or-patch"                          = "n/a"
          - "source-code"                               = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/nomis"
          - "stig-build-linux-medium-version"           = "2022.3.0"
          - "update-linux-version"                      = "1.0.2"
        } -> null
      - version      = "1.3.8" -> null

      - block_device_mapping {
          - device_name = "/dev/sda1" -> null
          - no_device   = false -> null

          - ebs {
              - delete_on_termination = "true" -> null
              - encrypted             = "true" -> null
              - iops                  = 0 -> null
              - kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691" -> null
              - throughput            = 0 -> null
              - volume_size           = 30 -> null
              - volume_type           = "gp3" -> null
            }
        }

      - component {
          - component_arn = "arn:aws:imagebuilder:eu-west-2:aws:component/update-linux/x.x.x" -> null
        }
      - component {
          - component_arn = "arn:aws:imagebuilder:eu-west-2:aws:component/stig-build-linux-medium/x.x.x" -> null
        }
      - component {
          - component_arn = "arn:aws:imagebuilder:eu-west-2:aws:component/aws-cli-version-2-linux/x.x.x" -> null
        }
      - component {
          - component_arn = "arn:aws:imagebuilder:eu-west-2:aws:component/amazon-cloudwatch-agent-linux/x.x.x" -> null
        }
      - component {
          - component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/nomis-rhel-7-9-baseimage-packages/0.0.1/1" -> null
        }
      - component {
          - component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/nomis-rhel-7-9-baseimage-python/0.0.1/1" -> null
        }
      - component {
          - component_arn = "arn:aws:imagebuilder:eu-west-2:374269020027:component/nomis-rhel-7-9-baseimage-ansible/1.3.8/1" -> null
        }

      - systems_manager_agent {
          - uninstall_after_build = false -> null
        }
    }

  # module.imagebuilder["rhel_7_9_baseimage"].aws_imagebuilder_infrastructure_configuration.this must be replaced
-/+ resource "aws_imagebuilder_infrastructure_configuration" "this" {
      ~ arn                           = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-rhel-7-9-baseimage-1-3-9" -> (known after apply)
      ~ date_created                  = "2022-10-06T12:47:32.742Z" -> (known after apply)
      + date_updated                  = (known after apply)
      ~ id                            = "arn:aws:imagebuilder:eu-west-2:374269020027:infrastructure-configuration/nomis-rhel-7-9-baseimage-1-3-9" -> (known after apply)
      ~ name                          = "nomis_rhel_7_9_baseimage_1_3_9" -> "nomis_rhel_7_9_baseimage_1_4_0" # forces replacement
      ~ resource_tags                 = {
          ~ "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.3.9" -> "nomis_rhel_7_9_baseimage/1.4.0"
          ~ "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.3.9" -> "nomis_rhel_7_9_baseimage/1.4.0"
          ~ "nomis_rhel_7_9_baseimage_ansible-version"  = "1.3.9" -> "1.4.0"
            # (16 unchanged elements hidden)
        }
      ~ tags                          = {
          ~ "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.3.9" -> "nomis_rhel_7_9_baseimage/1.4.0"
          ~ "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.3.9" -> "nomis_rhel_7_9_baseimage/1.4.0"
          ~ "nomis_rhel_7_9_baseimage_ansible-version"  = "1.3.9" -> "1.4.0"
            # (16 unchanged elements hidden)
        }
      ~ tags_all                      = {
          ~ "image-recipe"                              = "nomis_rhel_7_9_baseimage/1.3.9" -> "nomis_rhel_7_9_baseimage/1.4.0"
          ~ "infrastructure-configuration"              = "nomis_rhel_7_9_baseimage/1.3.9" -> "nomis_rhel_7_9_baseimage/1.4.0"
          ~ "nomis_rhel_7_9_baseimage_ansible-version"  = "1.3.9" -> "1.4.0"
            # (16 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 3 to change, 5 to destroy.

Warning: Experimental feature "module_variable_optional_attrs" is active

  on ../modules/imagebuilder/versions.tf line 2, in terraform:
   2:   experiments = [module_variable_optional_attrs]

Experimental features are subject to breaking changes in future minor or
patch releases, based on feedback.

If you have feedback on the design of this feature, please open a GitHub
issue to discuss it.

```